Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/test_app/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/slcdc.h
/*
 * Component description for SLCDC
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-12-19T08:59:38Z */
#ifndef _PIC32CXMTSH_SLCDC_COMPONENT_H_
#define _PIC32CXMTSH_SLCDC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SLCDC                                        */
/* ************************************************************************** */

/* -------- SLCDC_CR : (SLCDC Offset: 0x00) ( /W 32) Control Register -------- */
#define SLCDC_CR_LCDEN_Pos                    _UINT32_(0)                                          /* (SLCDC_CR) Enable the LCDC Position */
#define SLCDC_CR_LCDEN_Msk                    (_UINT32_(0x1) << SLCDC_CR_LCDEN_Pos)                /* (SLCDC_CR) Enable the LCDC Mask */
#define SLCDC_CR_LCDEN(value)                 (SLCDC_CR_LCDEN_Msk & (_UINT32_(value) << SLCDC_CR_LCDEN_Pos)) /* Assigment of value for LCDEN in the SLCDC_CR register */
#define SLCDC_CR_LCDDIS_Pos                   _UINT32_(1)                                          /* (SLCDC_CR) Disable LCDC Position */
#define SLCDC_CR_LCDDIS_Msk                   (_UINT32_(0x1) << SLCDC_CR_LCDDIS_Pos)               /* (SLCDC_CR) Disable LCDC Mask */
#define SLCDC_CR_LCDDIS(value)                (SLCDC_CR_LCDDIS_Msk & (_UINT32_(value) << SLCDC_CR_LCDDIS_Pos)) /* Assigment of value for LCDDIS in the SLCDC_CR register */
#define SLCDC_CR_SWRST_Pos                    _UINT32_(3)                                          /* (SLCDC_CR) Software Reset Position */
#define SLCDC_CR_SWRST_Msk                    (_UINT32_(0x1) << SLCDC_CR_SWRST_Pos)                /* (SLCDC_CR) Software Reset Mask */
#define SLCDC_CR_SWRST(value)                 (SLCDC_CR_SWRST_Msk & (_UINT32_(value) << SLCDC_CR_SWRST_Pos)) /* Assigment of value for SWRST in the SLCDC_CR register */
#define SLCDC_CR_FRZDF_Pos                    _UINT32_(6)                                          /* (SLCDC_CR) Freeze Display Panel Features Configuration Position */
#define SLCDC_CR_FRZDF_Msk                    (_UINT32_(0x1) << SLCDC_CR_FRZDF_Pos)                /* (SLCDC_CR) Freeze Display Panel Features Configuration Mask */
#define SLCDC_CR_FRZDF(value)                 (SLCDC_CR_FRZDF_Msk & (_UINT32_(value) << SLCDC_CR_FRZDF_Pos)) /* Assigment of value for FRZDF in the SLCDC_CR register */
#define SLCDC_CR_FRZMAP_Pos                   _UINT32_(7)                                          /* (SLCDC_CR) Freeze Remap Configuration Position */
#define SLCDC_CR_FRZMAP_Msk                   (_UINT32_(0x1) << SLCDC_CR_FRZMAP_Pos)               /* (SLCDC_CR) Freeze Remap Configuration Mask */
#define SLCDC_CR_FRZMAP(value)                (SLCDC_CR_FRZMAP_Msk & (_UINT32_(value) << SLCDC_CR_FRZMAP_Pos)) /* Assigment of value for FRZMAP in the SLCDC_CR register */
#define SLCDC_CR_FRZKEY_Pos                   _UINT32_(8)                                          /* (SLCDC_CR) Freeze Key (write-only) Position */
#define SLCDC_CR_FRZKEY_Msk                   (_UINT32_(0xFF) << SLCDC_CR_FRZKEY_Pos)              /* (SLCDC_CR) Freeze Key (write-only) Mask */
#define SLCDC_CR_FRZKEY(value)                (SLCDC_CR_FRZKEY_Msk & (_UINT32_(value) << SLCDC_CR_FRZKEY_Pos)) /* Assigment of value for FRZKEY in the SLCDC_CR register */
#define   SLCDC_CR_FRZKEY_PASSWD_Val          _UINT32_(0x4E)                                       /* (SLCDC_CR) Writing any other value in this field aborts the write operation of the FRZDF bit or FRZMAP bit. Always reads as 0.  */
#define SLCDC_CR_FRZKEY_PASSWD                (SLCDC_CR_FRZKEY_PASSWD_Val << SLCDC_CR_FRZKEY_Pos)  /* (SLCDC_CR) Writing any other value in this field aborts the write operation of the FRZDF bit or FRZMAP bit. Always reads as 0. Position  */
#define SLCDC_CR_Msk                          _UINT32_(0x0000FFCB)                                 /* (SLCDC_CR) Register Mask  */


/* -------- SLCDC_MR : (SLCDC Offset: 0x04) (R/W 32) Mode Register -------- */
#define SLCDC_MR_COMSEL_Pos                   _UINT32_(0)                                          /* (SLCDC_MR) Selection of the Number of Commons Position */
#define SLCDC_MR_COMSEL_Msk                   (_UINT32_(0x7) << SLCDC_MR_COMSEL_Pos)               /* (SLCDC_MR) Selection of the Number of Commons Mask */
#define SLCDC_MR_COMSEL(value)                (SLCDC_MR_COMSEL_Msk & (_UINT32_(value) << SLCDC_MR_COMSEL_Pos)) /* Assigment of value for COMSEL in the SLCDC_MR register */
#define   SLCDC_MR_COMSEL_COM_0_Val           _UINT32_(0x0)                                        /* (SLCDC_MR) COM0 is driven by SLCDC, COM1:7 are driven by digital function  */
#define   SLCDC_MR_COMSEL_COM_0TO1_Val        _UINT32_(0x1)                                        /* (SLCDC_MR) COM0:1 are driven by SLCDC, COM2:7 are driven by digital function  */
#define   SLCDC_MR_COMSEL_COM_0TO2_Val        _UINT32_(0x2)                                        /* (SLCDC_MR) COM0:2 are driven by SLCDC, COM3:7 are driven by digital function  */
#define   SLCDC_MR_COMSEL_COM_0TO3_Val        _UINT32_(0x3)                                        /* (SLCDC_MR) COM0:3 are driven by SLCDC, COM4:7 are driven by digital function  */
#define   SLCDC_MR_COMSEL_COM_0TO4_Val        _UINT32_(0x4)                                        /* (SLCDC_MR) COM0:4 are driven by SLCDC, COM5:7 are driven by digital function  */
#define   SLCDC_MR_COMSEL_COM_0TO5_Val        _UINT32_(0x5)                                        /* (SLCDC_MR) COM0:5 are driven by SLCDC, COM6:7 are driven by digital function  */
#define   SLCDC_MR_COMSEL_COM_0TO6_Val        _UINT32_(0x6)                                        /* (SLCDC_MR) COM0:6 are driven by SLCDC, COM7 driven by digital function  */
#define   SLCDC_MR_COMSEL_COM_0TO7_Val        _UINT32_(0x7)                                        /* (SLCDC_MR) COM0:7 are driven by SLCDC, no COM pin driven by digital function  */
#define SLCDC_MR_COMSEL_COM_0                 (SLCDC_MR_COMSEL_COM_0_Val << SLCDC_MR_COMSEL_Pos)   /* (SLCDC_MR) COM0 is driven by SLCDC, COM1:7 are driven by digital function Position  */
#define SLCDC_MR_COMSEL_COM_0TO1              (SLCDC_MR_COMSEL_COM_0TO1_Val << SLCDC_MR_COMSEL_Pos) /* (SLCDC_MR) COM0:1 are driven by SLCDC, COM2:7 are driven by digital function Position  */
#define SLCDC_MR_COMSEL_COM_0TO2              (SLCDC_MR_COMSEL_COM_0TO2_Val << SLCDC_MR_COMSEL_Pos) /* (SLCDC_MR) COM0:2 are driven by SLCDC, COM3:7 are driven by digital function Position  */
#define SLCDC_MR_COMSEL_COM_0TO3              (SLCDC_MR_COMSEL_COM_0TO3_Val << SLCDC_MR_COMSEL_Pos) /* (SLCDC_MR) COM0:3 are driven by SLCDC, COM4:7 are driven by digital function Position  */
#define SLCDC_MR_COMSEL_COM_0TO4              (SLCDC_MR_COMSEL_COM_0TO4_Val << SLCDC_MR_COMSEL_Pos) /* (SLCDC_MR) COM0:4 are driven by SLCDC, COM5:7 are driven by digital function Position  */
#define SLCDC_MR_COMSEL_COM_0TO5              (SLCDC_MR_COMSEL_COM_0TO5_Val << SLCDC_MR_COMSEL_Pos) /* (SLCDC_MR) COM0:5 are driven by SLCDC, COM6:7 are driven by digital function Position  */
#define SLCDC_MR_COMSEL_COM_0TO6              (SLCDC_MR_COMSEL_COM_0TO6_Val << SLCDC_MR_COMSEL_Pos) /* (SLCDC_MR) COM0:6 are driven by SLCDC, COM7 driven by digital function Position  */
#define SLCDC_MR_COMSEL_COM_0TO7              (SLCDC_MR_COMSEL_COM_0TO7_Val << SLCDC_MR_COMSEL_Pos) /* (SLCDC_MR) COM0:7 are driven by SLCDC, no COM pin driven by digital function Position  */
#define SLCDC_MR_SEGSEL_Pos                   _UINT32_(8)                                          /* (SLCDC_MR) Selection of the Number of Segments Position */
#define SLCDC_MR_SEGSEL_Msk                   (_UINT32_(0x3F) << SLCDC_MR_SEGSEL_Pos)              /* (SLCDC_MR) Selection of the Number of Segments Mask */
#define SLCDC_MR_SEGSEL(value)                (SLCDC_MR_SEGSEL_Msk & (_UINT32_(value) << SLCDC_MR_SEGSEL_Pos)) /* Assigment of value for SEGSEL in the SLCDC_MR register */
#define SLCDC_MR_BUFTIME_Pos                  _UINT32_(16)                                         /* (SLCDC_MR) Buffer On-Time Position */
#define SLCDC_MR_BUFTIME_Msk                  (_UINT32_(0xF) << SLCDC_MR_BUFTIME_Pos)              /* (SLCDC_MR) Buffer On-Time Mask */
#define SLCDC_MR_BUFTIME(value)               (SLCDC_MR_BUFTIME_Msk & (_UINT32_(value) << SLCDC_MR_BUFTIME_Pos)) /* Assigment of value for BUFTIME in the SLCDC_MR register */
#define   SLCDC_MR_BUFTIME_OFF_Val            _UINT32_(0x0)                                        /* (SLCDC_MR) Nominal drive time is 0% of SLCK period  */
#define   SLCDC_MR_BUFTIME_X2_SLCK_PERIOD_Val _UINT32_(0x1)                                        /* (SLCDC_MR) Nominal drive time is 2 periods of SLCK clock  */
#define   SLCDC_MR_BUFTIME_X4_SLCK_PERIOD_Val _UINT32_(0x2)                                        /* (SLCDC_MR) Nominal drive time is 4 periods of SLCK clock  */
#define   SLCDC_MR_BUFTIME_X8_SLCK_PERIOD_Val _UINT32_(0x3)                                        /* (SLCDC_MR) Nominal drive time is 8 periods of SLCK clock  */
#define   SLCDC_MR_BUFTIME_X16_SLCK_PERIOD_Val _UINT32_(0x4)                                        /* (SLCDC_MR) Nominal drive time is 16 periods of SLCK clock  */
#define   SLCDC_MR_BUFTIME_X32_SLCK_PERIOD_Val _UINT32_(0x5)                                        /* (SLCDC_MR) Nominal drive time is 32 periods of SLCK clock  */
#define   SLCDC_MR_BUFTIME_X64_SLCK_PERIOD_Val _UINT32_(0x6)                                        /* (SLCDC_MR) Nominal drive time is 64 periods of SLCK clock  */
#define   SLCDC_MR_BUFTIME_X128_SLCK_PERIOD_Val _UINT32_(0x7)                                        /* (SLCDC_MR) Nominal drive time is 128 periods of SLCK clock  */
#define   SLCDC_MR_BUFTIME_PERCENT_50_Val     _UINT32_(0x8)                                        /* (SLCDC_MR) Nominal drive time is 50% of SLCK period  */
#define   SLCDC_MR_BUFTIME_PERCENT_100_Val    _UINT32_(0x9)                                        /* (SLCDC_MR) Nominal drive time is 100% of SLCK period  */
#define SLCDC_MR_BUFTIME_OFF                  (SLCDC_MR_BUFTIME_OFF_Val << SLCDC_MR_BUFTIME_Pos)   /* (SLCDC_MR) Nominal drive time is 0% of SLCK period Position  */
#define SLCDC_MR_BUFTIME_X2_SLCK_PERIOD       (SLCDC_MR_BUFTIME_X2_SLCK_PERIOD_Val << SLCDC_MR_BUFTIME_Pos) /* (SLCDC_MR) Nominal drive time is 2 periods of SLCK clock Position  */
#define SLCDC_MR_BUFTIME_X4_SLCK_PERIOD       (SLCDC_MR_BUFTIME_X4_SLCK_PERIOD_Val << SLCDC_MR_BUFTIME_Pos) /* (SLCDC_MR) Nominal drive time is 4 periods of SLCK clock Position  */
#define SLCDC_MR_BUFTIME_X8_SLCK_PERIOD       (SLCDC_MR_BUFTIME_X8_SLCK_PERIOD_Val << SLCDC_MR_BUFTIME_Pos) /* (SLCDC_MR) Nominal drive time is 8 periods of SLCK clock Position  */
#define SLCDC_MR_BUFTIME_X16_SLCK_PERIOD      (SLCDC_MR_BUFTIME_X16_SLCK_PERIOD_Val << SLCDC_MR_BUFTIME_Pos) /* (SLCDC_MR) Nominal drive time is 16 periods of SLCK clock Position  */
#define SLCDC_MR_BUFTIME_X32_SLCK_PERIOD      (SLCDC_MR_BUFTIME_X32_SLCK_PERIOD_Val << SLCDC_MR_BUFTIME_Pos) /* (SLCDC_MR) Nominal drive time is 32 periods of SLCK clock Position  */
#define SLCDC_MR_BUFTIME_X64_SLCK_PERIOD      (SLCDC_MR_BUFTIME_X64_SLCK_PERIOD_Val << SLCDC_MR_BUFTIME_Pos) /* (SLCDC_MR) Nominal drive time is 64 periods of SLCK clock Position  */
#define SLCDC_MR_BUFTIME_X128_SLCK_PERIOD     (SLCDC_MR_BUFTIME_X128_SLCK_PERIOD_Val << SLCDC_MR_BUFTIME_Pos) /* (SLCDC_MR) Nominal drive time is 128 periods of SLCK clock Position  */
#define SLCDC_MR_BUFTIME_PERCENT_50           (SLCDC_MR_BUFTIME_PERCENT_50_Val << SLCDC_MR_BUFTIME_Pos) /* (SLCDC_MR) Nominal drive time is 50% of SLCK period Position  */
#define SLCDC_MR_BUFTIME_PERCENT_100          (SLCDC_MR_BUFTIME_PERCENT_100_Val << SLCDC_MR_BUFTIME_Pos) /* (SLCDC_MR) Nominal drive time is 100% of SLCK period Position  */
#define SLCDC_MR_BIAS_Pos                     _UINT32_(20)                                         /* (SLCDC_MR) LCD Display Configuration Position */
#define SLCDC_MR_BIAS_Msk                     (_UINT32_(0x3) << SLCDC_MR_BIAS_Pos)                 /* (SLCDC_MR) LCD Display Configuration Mask */
#define SLCDC_MR_BIAS(value)                  (SLCDC_MR_BIAS_Msk & (_UINT32_(value) << SLCDC_MR_BIAS_Pos)) /* Assigment of value for BIAS in the SLCDC_MR register */
#define   SLCDC_MR_BIAS_STATIC_Val            _UINT32_(0x0)                                        /* (SLCDC_MR) Static  */
#define   SLCDC_MR_BIAS_BIAS_1_2_Val          _UINT32_(0x1)                                        /* (SLCDC_MR) Bias 1/2  */
#define   SLCDC_MR_BIAS_BIAS_1_3_Val          _UINT32_(0x2)                                        /* (SLCDC_MR) Bias 1/3  */
#define   SLCDC_MR_BIAS_BIAS_1_4_Val          _UINT32_(0x3)                                        /* (SLCDC_MR) Bias 1/4  */
#define SLCDC_MR_BIAS_STATIC                  (SLCDC_MR_BIAS_STATIC_Val << SLCDC_MR_BIAS_Pos)      /* (SLCDC_MR) Static Position  */
#define SLCDC_MR_BIAS_BIAS_1_2                (SLCDC_MR_BIAS_BIAS_1_2_Val << SLCDC_MR_BIAS_Pos)    /* (SLCDC_MR) Bias 1/2 Position  */
#define SLCDC_MR_BIAS_BIAS_1_3                (SLCDC_MR_BIAS_BIAS_1_3_Val << SLCDC_MR_BIAS_Pos)    /* (SLCDC_MR) Bias 1/3 Position  */
#define SLCDC_MR_BIAS_BIAS_1_4                (SLCDC_MR_BIAS_BIAS_1_4_Val << SLCDC_MR_BIAS_Pos)    /* (SLCDC_MR) Bias 1/4 Position  */
#define SLCDC_MR_LPMODE_Pos                   _UINT32_(24)                                         /* (SLCDC_MR) Low-Power Mode Position */
#define SLCDC_MR_LPMODE_Msk                   (_UINT32_(0x1) << SLCDC_MR_LPMODE_Pos)               /* (SLCDC_MR) Low-Power Mode Mask */
#define SLCDC_MR_LPMODE(value)                (SLCDC_MR_LPMODE_Msk & (_UINT32_(value) << SLCDC_MR_LPMODE_Pos)) /* Assigment of value for LPMODE in the SLCDC_MR register */
#define SLCDC_MR_Msk                          _UINT32_(0x013F3F07)                                 /* (SLCDC_MR) Register Mask  */


/* -------- SLCDC_FRR : (SLCDC Offset: 0x08) (R/W 32) Frame Rate Register -------- */
#define SLCDC_FRR_PRESC_Pos                   _UINT32_(0)                                          /* (SLCDC_FRR) Clock Prescaler Position */
#define SLCDC_FRR_PRESC_Msk                   (_UINT32_(0x7) << SLCDC_FRR_PRESC_Pos)               /* (SLCDC_FRR) Clock Prescaler Mask */
#define SLCDC_FRR_PRESC(value)                (SLCDC_FRR_PRESC_Msk & (_UINT32_(value) << SLCDC_FRR_PRESC_Pos)) /* Assigment of value for PRESC in the SLCDC_FRR register */
#define   SLCDC_FRR_PRESC_SLCK_DIV8_Val       _UINT32_(0x0)                                        /* (SLCDC_FRR) Slow clock is divided by 8  */
#define   SLCDC_FRR_PRESC_SLCK_DIV16_Val      _UINT32_(0x1)                                        /* (SLCDC_FRR) Slow clock is divided by 16  */
#define   SLCDC_FRR_PRESC_SLCK_DIV32_Val      _UINT32_(0x2)                                        /* (SLCDC_FRR) Slow clock is divided by 32  */
#define   SLCDC_FRR_PRESC_SLCK_DIV64_Val      _UINT32_(0x3)                                        /* (SLCDC_FRR) Slow clock is divided by 64  */
#define   SLCDC_FRR_PRESC_SLCK_DIV128_Val     _UINT32_(0x4)                                        /* (SLCDC_FRR) Slow clock is divided by 128  */
#define   SLCDC_FRR_PRESC_SLCK_DIV256_Val     _UINT32_(0x5)                                        /* (SLCDC_FRR) Slow clock is divided by 256  */
#define   SLCDC_FRR_PRESC_SLCK_DIV512_Val     _UINT32_(0x6)                                        /* (SLCDC_FRR) Slow clock is divided by 512  */
#define   SLCDC_FRR_PRESC_SLCK_DIV1024_Val    _UINT32_(0x7)                                        /* (SLCDC_FRR) Slow clock is divided by 1024  */
#define SLCDC_FRR_PRESC_SLCK_DIV8             (SLCDC_FRR_PRESC_SLCK_DIV8_Val << SLCDC_FRR_PRESC_Pos) /* (SLCDC_FRR) Slow clock is divided by 8 Position  */
#define SLCDC_FRR_PRESC_SLCK_DIV16            (SLCDC_FRR_PRESC_SLCK_DIV16_Val << SLCDC_FRR_PRESC_Pos) /* (SLCDC_FRR) Slow clock is divided by 16 Position  */
#define SLCDC_FRR_PRESC_SLCK_DIV32            (SLCDC_FRR_PRESC_SLCK_DIV32_Val << SLCDC_FRR_PRESC_Pos) /* (SLCDC_FRR) Slow clock is divided by 32 Position  */
#define SLCDC_FRR_PRESC_SLCK_DIV64            (SLCDC_FRR_PRESC_SLCK_DIV64_Val << SLCDC_FRR_PRESC_Pos) /* (SLCDC_FRR) Slow clock is divided by 64 Position  */
#define SLCDC_FRR_PRESC_SLCK_DIV128           (SLCDC_FRR_PRESC_SLCK_DIV128_Val << SLCDC_FRR_PRESC_Pos) /* (SLCDC_FRR) Slow clock is divided by 128 Position  */
#define SLCDC_FRR_PRESC_SLCK_DIV256           (SLCDC_FRR_PRESC_SLCK_DIV256_Val << SLCDC_FRR_PRESC_Pos) /* (SLCDC_FRR) Slow clock is divided by 256 Position  */
#define SLCDC_FRR_PRESC_SLCK_DIV512           (SLCDC_FRR_PRESC_SLCK_DIV512_Val << SLCDC_FRR_PRESC_Pos) /* (SLCDC_FRR) Slow clock is divided by 512 Position  */
#define SLCDC_FRR_PRESC_SLCK_DIV1024          (SLCDC_FRR_PRESC_SLCK_DIV1024_Val << SLCDC_FRR_PRESC_Pos) /* (SLCDC_FRR) Slow clock is divided by 1024 Position  */
#define SLCDC_FRR_DIV_Pos                     _UINT32_(8)                                          /* (SLCDC_FRR) Clock Division Position */
#define SLCDC_FRR_DIV_Msk                     (_UINT32_(0x7) << SLCDC_FRR_DIV_Pos)                 /* (SLCDC_FRR) Clock Division Mask */
#define SLCDC_FRR_DIV(value)                  (SLCDC_FRR_DIV_Msk & (_UINT32_(value) << SLCDC_FRR_DIV_Pos)) /* Assigment of value for DIV in the SLCDC_FRR register */
#define   SLCDC_FRR_DIV_PRESC_CLK_DIV1_Val    _UINT32_(0x0)                                        /* (SLCDC_FRR) Clock output from prescaler is divided by 1  */
#define   SLCDC_FRR_DIV_PRESC_CLK_DIV2_Val    _UINT32_(0x1)                                        /* (SLCDC_FRR) Clock output from prescaler is divided by 2  */
#define   SLCDC_FRR_DIV_PRESC_CLK_DIV3_Val    _UINT32_(0x2)                                        /* (SLCDC_FRR) Clock output from prescaler is divided by 3  */
#define   SLCDC_FRR_DIV_PRESC_CLK_DIV4_Val    _UINT32_(0x3)                                        /* (SLCDC_FRR) Clock output from prescaler is divided by 4  */
#define   SLCDC_FRR_DIV_PRESC_CLK_DIV5_Val    _UINT32_(0x4)                                        /* (SLCDC_FRR) Clock output from prescaler is divided by 5  */
#define   SLCDC_FRR_DIV_PRESC_CLK_DIV6_Val    _UINT32_(0x5)                                        /* (SLCDC_FRR) Clock output from prescaler is divided by 6  */
#define   SLCDC_FRR_DIV_PRESC_CLK_DIV7_Val    _UINT32_(0x6)                                        /* (SLCDC_FRR) Clock output from prescaler is divided by 7  */
#define   SLCDC_FRR_DIV_PRESC_CLK_DIV8_Val    _UINT32_(0x7)                                        /* (SLCDC_FRR) Clock output from prescaler is divided by 8  */
#define SLCDC_FRR_DIV_PRESC_CLK_DIV1          (SLCDC_FRR_DIV_PRESC_CLK_DIV1_Val << SLCDC_FRR_DIV_Pos) /* (SLCDC_FRR) Clock output from prescaler is divided by 1 Position  */
#define SLCDC_FRR_DIV_PRESC_CLK_DIV2          (SLCDC_FRR_DIV_PRESC_CLK_DIV2_Val << SLCDC_FRR_DIV_Pos) /* (SLCDC_FRR) Clock output from prescaler is divided by 2 Position  */
#define SLCDC_FRR_DIV_PRESC_CLK_DIV3          (SLCDC_FRR_DIV_PRESC_CLK_DIV3_Val << SLCDC_FRR_DIV_Pos) /* (SLCDC_FRR) Clock output from prescaler is divided by 3 Position  */
#define SLCDC_FRR_DIV_PRESC_CLK_DIV4          (SLCDC_FRR_DIV_PRESC_CLK_DIV4_Val << SLCDC_FRR_DIV_Pos) /* (SLCDC_FRR) Clock output from prescaler is divided by 4 Position  */
#define SLCDC_FRR_DIV_PRESC_CLK_DIV5          (SLCDC_FRR_DIV_PRESC_CLK_DIV5_Val << SLCDC_FRR_DIV_Pos) /* (SLCDC_FRR) Clock output from prescaler is divided by 5 Position  */
#define SLCDC_FRR_DIV_PRESC_CLK_DIV6          (SLCDC_FRR_DIV_PRESC_CLK_DIV6_Val << SLCDC_FRR_DIV_Pos) /* (SLCDC_FRR) Clock output from prescaler is divided by 6 Position  */
#define SLCDC_FRR_DIV_PRESC_CLK_DIV7          (SLCDC_FRR_DIV_PRESC_CLK_DIV7_Val << SLCDC_FRR_DIV_Pos) /* (SLCDC_FRR) Clock output from prescaler is divided by 7 Position  */
#define SLCDC_FRR_DIV_PRESC_CLK_DIV8          (SLCDC_FRR_DIV_PRESC_CLK_DIV8_Val << SLCDC_FRR_DIV_Pos) /* (SLCDC_FRR) Clock output from prescaler is divided by 8 Position  */
#define SLCDC_FRR_Msk                         _UINT32_(0x00000707)                                 /* (SLCDC_FRR) Register Mask  */


